app/controllers/locations_controller.rb

  def index
    @locations = Location.all
---
SELECT * FROM "locations"

  def show
    @location = Location.find(params[:id])
---
SELECT * FROM "locations" WHERE ("locations"."id" = 1)

  def create
    @location = Location.new(params[:location])

    respond_to do |format|
      if @location.save
---
INSERT INTO "locations" ("created_at", "updated_at", "lng", "description", "lat") VALUES('2010-07-29 21:38:03', '2010-07-29 21:38:03', '-7.2074', '31 The Pines, Ballinakill Downs, Waterford, co. Waterford, Ireland', '52.3118')