app/controllers/milestone_categories_controller.rb

  def show
    @milestone_category = MilestoneCategory.find(params[:id])
---
SELECT * FROM "milestone_categories" WHERE ("milestone_categories"."id" = 944570480)