app/controllers/milestones_controller.rb

SELECT * FROM "milestones"
---
  def index
    @milestones = Milestone.all

SELECT * FROM "milestones" WHERE ("milestones"."id" = 1)
---
  def show
    @milestone = Milestone.find(params[:id])

INSERT INTO "milestones" ("name", "created_at", "reward", "updated_at") VALUES('Chicken Pox', '2010-07-29 21:35:54', 10, '2010-07-29 21:35:54')
---
  def create
    @milestone = Milestone.new(params[:milestone])

    respond_to do |format|
      if @milestone.save