app/controllers/parents_controller.rb

  def index
    @parents = Parent.all
---
SELECT * FROM "parents"

  def show
    @parent = Parent.find(params[:id])
---
SELECT * FROM "parents" WHERE ("parents"."id" = 0)