app/controllers/statuses_controller.rb

SELECT * FROM "statuses" ORDER BY created_at DESC
---
  def index
    @statuses = Status.all

SELECT * FROM "statuses" WHERE ("statuses"."id" = 0) ORDER BY created_at DESC
---
  def show
    @status = Status.find(params[:id])

SELECT * FROM "statuses" WHERE ("statuses"."id" = 214540408)
---
  def edit
    @status = Status.find(params[:id])

INSERT INTO "statuses" ("milestone_id", "created_at", "body", "updated_at", "location_id", "child_id") VALUES(956753527, '2010-07-29 22:15:42', 'daddy', '2010-07-29 22:15:42', 591404843, 228073172)
---
  def create
    @status = Status.new(params[:status])

    respond_to do |format|
      if @status.save